Tutorials/impellerAndSphere/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleHFDIBFoam;
//~ application     simpleHFDIBDyMFoam;

//~ startFrom       startTime;
startFrom       latestTime;

startTime       0;

stopAt          endTime;
//~ stopAt          writeNow;

endTime         0.2;
//~ endTime         0.02;

deltaT          0.0001;
//~ deltaT          0.00001;
//~ deltaT          1e-8;

writeControl    adjustableRunTime;
//~ writeControl    timeStep;
//~ 
writeInterval   0.002;
//~ writeInterval   0.005;
//~ writeInterval   0.001;
//~ writeInterval   0.0001;
//~ writeInterval   1e-7;
//~ writeInterval   1;
//~ writeInterval   5;
//~ writeInterval   0.002;


purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression uncompressed;

timeFormat      general;

timePrecision   8;

maxCo           1.0;

maxDeltaT       0.001;

adjustTimeStep  yes;

runTimeModifiable yes;

functions
{
      #include "probes"
};

// Note (20190104):
// - there is something incredibly rotten in the state of Denmark
//   for the computation to work, it has to be initialized with writing
//   out each timeStep (or something similar)
// Q: how coud settings in fvSolution and especially controlDict affect
//    a solver behavior? Are there any unfortunately named variables?


// ************************************************************************* //
